nanoframework/nf-interpreter/targets/ESP32/_nanoCLR/nanoFramework.Hardware.ESP32/nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad.cpp
//
// Copyright (c) .NET Foundation and Contributors
// Portions Copyright (c) Microsoft Corporation.  All rights reserved.
// See LICENSE file in the project root for full license information.
//

#include "nanoFramework_hardware_esp32_native.h"
#include <nanoCLR_Hardware.h>
#include <targetPAL.h>

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

static int numberInitialzed = 0;
static bool isTouchInitialized = false;
static bool isTouchPadUsed[TOUCH_PAD_MAX];
static bool isFilterOn = false;
static TaskHandle_t handleReadTask = NULL;
static bool touchValues[TOUCH_PAD_MAX];
static uint32_t thresholds[TOUCH_PAD_MAX];
static bool isTimeModeOn = false;
static uint32_t lastTouchValues[TOUCH_PAD_MAX];
static touch_fsm_mode_t measurementMode;

#endif

HRESULT GetAndCheckTouchPadNumber(CLR_RT_StackFrame &stack, touch_pad_t *padNumber)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    // Get the stack
    CLR_RT_HeapBlock *pThis = stack.This();
    FAULT_ON_NULL(pThis);
    *padNumber =
        (touch_pad_t)(pThis[Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
                                FIELD___touchPadNumber]
                          .NumericByRef()
                          .s4);

    // Let's make sure it's a proper pin
    if ((*padNumber < 0) || (*padNumber >= TOUCH_PAD_MAX))
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::NativeInit___VOID(
    CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    touch_pad_t padNumber;
    NANOCLR_CHECK_HRESULT(GetAndCheckTouchPadNumber(stack, &padNumber));

    // We make sure the pin is not yet open
    if (isTouchPadUsed[padNumber])
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    // We initalize the pin
    MakeSureTouchIsInitialized();
    if (touch_pad_io_init(padNumber) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

#if defined(CONFIG_IDF_TARGET_ESP32)
    if (touch_pad_config(padNumber, 0) != ESP_OK)
#else
    if (touch_pad_config(padNumber) != ESP_OK)
#endif
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

    // And we increase the number and mark the pin as open
    numberInitialzed++;
    isTouchPadUsed[padNumber] = true;

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::NativeDeinit___VOID(
    CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    if (numberInitialzed == 1)
    {
        touch_pad_deinit();
        isTouchInitialized = false;
    }

    touch_pad_t padNumber;
    NANOCLR_CHECK_HRESULT(GetAndCheckTouchPadNumber(stack, &padNumber));

    // Decrease the counter and make sure we mark this one as not used anymore
    numberInitialzed--;
    isTouchPadUsed[padNumber] = false;

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::NativeRead___U4(
    CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    touch_pad_t padNumber;
    uint32_t touchValue;
    NANOCLR_CHECK_HRESULT(GetAndCheckTouchPadNumber(stack, &padNumber));

    // If we already have the background task running
    if (isTimeModeOn)
    {
        touchValue = lastTouchValues[padNumber];
    }
    else
    {
        touchValue = TouchPadRead(padNumber);
    }

    stack.SetResult_U4(touchValue);

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeGetThreshold___U4(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    touch_pad_t padNumber;
    NANOCLR_CHECK_HRESULT(GetAndCheckTouchPadNumber(stack, &padNumber));

#if defined(CONFIG_IDF_TARGET_ESP32)
    uint16_t threshold;
#else
    uint32_t threshold;
#endif
    if (touch_pad_get_thresh(padNumber, &threshold) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

    // Make sure we store it for later usage
    thresholds[padNumber] = threshold;
    stack.SetResult_U4(threshold);

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeSetThreshold___VOID__U4(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    touch_pad_t padNumber;
    NANOCLR_CHECK_HRESULT(GetAndCheckTouchPadNumber(stack, &padNumber));

#if defined(CONFIG_IDF_TARGET_ESP32)
    uint16_t threshold;
    // Non static function, Arg1 is the first argument
    threshold = (uint16_t)stack.Arg1().NumericByRef().u4;
#else
    uint32_t threshold;
    // Non static function, Arg1 is the first argument
    threshold = (uint32_t)stack.Arg1().NumericByRef().u4;

#endif
    if (touch_pad_set_thresh(padNumber, threshold) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

    // Make sure we store it for later usage
    thresholds[padNumber] = threshold;

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

