nanoframework/nf-interpreter/targets/ESP32/_nanoCLR/nanoFramework.Hardware.ESP32/nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad.cpp
    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeGetTouchSpeed___VOID__BYREF_I4__BYREF_I4(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    touch_pad_t padNumber;
    touch_cnt_slope_t slope;
    touch_tie_opt_t opt;

    NANOCLR_CHECK_HRESULT(GetAndCheckTouchPadNumber(stack, &padNumber));
    if (touch_pad_get_cnt_mode(padNumber, &slope, &opt) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

    // Arg1 as we are in a non static function.
    CLR_RT_HeapBlock bhSlope;
    CLR_RT_HeapBlock bhOpt;
    bhSlope.SetInteger(slope);
    NANOCLR_CHECK_HRESULT(bhSlope.StoreToReference(stack.Arg1(), 0));
    bhOpt.SetInteger(opt);
    NANOCLR_CHECK_HRESULT(bhOpt.StoreToReference(stack.Arg2(), 0));

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeSetChargeSpeed___VOID__I4__I4(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    touch_pad_t padNumber;
    touch_cnt_slope_t slope;
    touch_tie_opt_t opt;

    NANOCLR_CHECK_HRESULT(GetAndCheckTouchPadNumber(stack, &padNumber));
    // Non static function, Arg1 is the first argument
    slope = (touch_cnt_slope_t)stack.Arg1().NumericByRef().u4;
    opt = (touch_tie_opt_t)stack.Arg2().NumericByRef().u4;
    if (touch_pad_set_cnt_mode(padNumber, slope, opt) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeCalibrate___I4__I4(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    touch_pad_t padNumber;
    int count;
    double average = 0;

    NANOCLR_CHECK_HRESULT(GetAndCheckTouchPadNumber(stack, &padNumber));
    // Non static function, Arg1 is the first argument
    count = (int)stack.Arg1().NumericByRef().s4;

    // We will read the values and make an average
    for (int i = 0; i < count; i++)
    {
        average = (average * i + TouchPadRead(padNumber)) / (i + 1);
    }

    // And we return the average
    stack.SetResult_I4((int)average);

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeGetGpioNumberFromTouchNumber___STATIC__I4__I4(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    int padNumber = (int)(stack.Arg0().NumericByRef().u4);
    int gpioNumber = -1;

    // Let's make sure it's a proper pin
    if ((padNumber < 0) || (padNumber >= TOUCH_PAD_MAX))
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    /*!< Touch pad channel 0 is GPIO4(ESP32) */
    /*!< Touch pad channel 1 is GPIO0(ESP32) / GPIO1(ESP32-S2) */
    /*!< Touch pad channel 2 is GPIO2(ESP32) / GPIO2(ESP32-S2) */
    /*!< Touch pad channel 3 is GPIO15(ESP32) / GPIO3(ESP32-S2) */
    /*!< Touch pad channel 4 is GPIO13(ESP32) / GPIO4(ESP32-S2) */
    /*!< Touch pad channel 5 is GPIO12(ESP32) / GPIO5(ESP32-S2) */
    /*!< Touch pad channel 6 is GPIO14(ESP32) / GPIO6(ESP32-S2) */
    /*!< Touch pad channel 7 is GPIO27(ESP32) / GPIO7(ESP32-S2) */
    /*!< Touch pad channel 8 is GPIO33(ESP32) / GPIO8(ESP32-S2) */
    /*!< Touch pad channel 9 is GPIO32(ESP32) / GPIO9(ESP32-S2) */
    /*!< Touch channel 10 is GPIO10(ESP32-S2) */
    /*!< Touch channel 11 is GPIO11(ESP32-S2) */
    /*!< Touch channel 12 is GPIO12(ESP32-S2) */
    /*!< Touch channel 13 is GPIO13(ESP32-S2) */
    /*!< Touch channel 14 is GPIO14(ESP32-S2) */

    // This is the ESP32-S2 series
    if (SOC_TOUCH_SENSOR_NUM > 10)
    {
        // In this case it's simple
        if (padNumber > 0)
        {
            gpioNumber = padNumber;
        }
    }
    else
    {
        // This is traditional ESP32
        switch (padNumber)
        {
            case TOUCH_PAD_NUM0:
                gpioNumber = 4;
                break;

            case TOUCH_PAD_NUM1:
                gpioNumber = 0;
                break;

            case TOUCH_PAD_NUM2:
                gpioNumber = 2;
                break;

            case TOUCH_PAD_NUM3:
                gpioNumber = 15;
                break;

            case TOUCH_PAD_NUM4:
                gpioNumber = 13;
                break;

            case TOUCH_PAD_NUM5:
                gpioNumber = 12;
                break;

            case TOUCH_PAD_NUM6:
                gpioNumber = 14;
                break;

            case TOUCH_PAD_NUM7:
                gpioNumber = 27;
                break;

            case TOUCH_PAD_NUM8:
                gpioNumber = 33;
                break;

            case TOUCH_PAD_NUM9:
                gpioNumber = 32;
                break;
        }
    }

    stack.SetResult_I4(gpioNumber);

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeGetTriggerMode___STATIC__nanoFrameworkHardwareEsp32TouchTouchTriggerMode(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

// Not implemented in this IDF version on the S2/S3 ||
// defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
#if defined(CONFIG_IDF_TARGET_ESP32)

    // For static functions, we need to make sure that we have the touch pad initialized
    MakeSureTouchIsInitialized();

    touch_trigger_mode_t triggerMode;
    if (touch_pad_get_trigger_mode(&triggerMode) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

    stack.SetResult_I4(triggerMode);

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

