nanoframework/nf-interpreter/targets/ESP32/_nanoCLR/nanoFramework.Hardware.ESP32/nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad.cpp
    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeSetTriggerMode___STATIC__VOID__nanoFrameworkHardwareEsp32TouchTouchTriggerMode(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

// Not implemented in this IDF version on the S2/S3 ||
// defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
#if defined(CONFIG_IDF_TARGET_ESP32)

    // For static functions, we need to make sure that we have the touch pad initialized
    MakeSureTouchIsInitialized();
    touch_trigger_mode_t triggerMode = (touch_trigger_mode_t)stack.Arg0().NumericByRef().s4;
    if (touch_pad_set_trigger_mode(triggerMode) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeGetTriggerSource___STATIC__nanoFrameworkHardwareEsp32TouchWakeUpSource(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

// Not implemented in this IDF version on the S2/S3 ||
// defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
#if defined(CONFIG_IDF_TARGET_ESP32)

    // For static functions, we need to make sure that we have the touch pad initialized
    MakeSureTouchIsInitialized();
    touch_trigger_src_t triggerSource;

    if (touch_pad_get_trigger_source(&triggerSource) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

    stack.SetResult_I4(triggerSource);

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeSetTriggerSource___STATIC__VOID__nanoFrameworkHardwareEsp32TouchWakeUpSource(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

// Not implemented in this IDF version on the S2/S3 ||
// defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
#if defined(CONFIG_IDF_TARGET_ESP32)

    // For static functions, we need to make sure that we have the touch pad initialized
    MakeSureTouchIsInitialized();
    touch_trigger_src_t triggerSource = (touch_trigger_src_t)stack.Arg0().NumericByRef().s4;
    if (touch_pad_set_trigger_source(triggerSource) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeGetMeasurementMode___STATIC__nanoFrameworkHardwareEsp32TouchMeasurementMode(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    // For static functions, we need to make sure that we have the touch pad initialized
    MakeSureTouchIsInitialized();

    stack.SetResult_I4(measurementMode);

    NANOCLR_NOCLEANUP_NOLABEL();

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
    NANOCLR_NOCLEANUP();
#endif
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeSetMeasurementMode___STATIC__VOID__nanoFrameworkHardwareEsp32TouchMeasurementMode(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    // For static functions, we need to make sure that we have the touch pad initialized
    MakeSureTouchIsInitialized();
    measurementMode = (touch_fsm_mode_t)stack.Arg0().NumericByRef().s4;

    // TODO: once we'll use IDF 5.0 or a version where the FSM start is present
    // TODO: once tested on the S2/S3, FSM may be able to be used instead.
    // This section will have to be adjusted.

    // Do we need to stop the task?
    if (measurementMode == TOUCH_FSM_MODE_SW)
    {
        isTimeModeOn = false;
        // If we just switch mode, we have to wait for the task to exit
        // So killing it
        if (handleReadTask != NULL)
        {
            vTaskDelete(handleReadTask);
        }

        // Waiting a bit to make sure the task is properly deleted
        vTaskDelay(100 / portTICK_PERIOD_MS);
        handleReadTask = NULL;
    }

    // As the ESP32 in this current version of IDF does not have a task to start the measurement,
    // we do it in a task and don't change the mode.
    if (measurementMode == TOUCH_FSM_MODE_TIMER)
    {
        if (!isTimeModeOn)
        {
            isTimeModeOn = true;
            // Start a task to show what pads have been touched
            xTaskCreate(&ReadTask, "ReadTask", 4096, NULL, 5, &handleReadTask);
        }
    }

    NANOCLR_NOCLEANUP_NOLABEL();

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
    NANOCLR_NOCLEANUP();
#endif
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeSetVoltage___STATIC__VOID__nanoFrameworkHardwareEsp32TouchTouchHighVoltage__nanoFrameworkHardwareEsp32TouchTouchLowVoltage__nanoFrameworkHardwareEsp32TouchTouchHighVoltageAttenuation(
        CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    // For static functions, we need to make sure that we have the touch pad initialized
    MakeSureTouchIsInitialized();
    touch_high_volt_t refh = (touch_high_volt_t)stack.Arg0().NumericByRef().s4;
    touch_low_volt_t refl = (touch_low_volt_t)stack.Arg1().NumericByRef().s4;
    touch_volt_atten_t atten = (touch_volt_atten_t)stack.Arg2().NumericByRef().s4;

    if (touch_pad_set_voltage(refh, refl, atten) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeGetVoltage___STATIC__VOID__BYREF_nanoFrameworkHardwareEsp32TouchTouchHighVoltage__BYREF_nanoFrameworkHardwareEsp32TouchTouchLowVoltage__BYREF_nanoFrameworkHardwareEsp32TouchTouchHighVoltageAttenuation(
        CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

