nanoframework/nf-interpreter/targets/ESP32/_nanoCLR/nanoFramework.Hardware.ESP32/nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad.cpp
    touch_high_volt_t refh;
    touch_low_volt_t refl;
    touch_volt_atten_t atten;

    // Get the voltage
    if (touch_pad_get_voltage(&refh, &refl, &atten) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

    CLR_RT_HeapBlock bhRefh;
    CLR_RT_HeapBlock bhRefl;
    CLR_RT_HeapBlock bhAtten;
    bhRefh.SetInteger(refh);
    NANOCLR_CHECK_HRESULT(bhRefh.StoreToReference(stack.Arg0(), 0));
    bhRefl.SetInteger(refl);
    NANOCLR_CHECK_HRESULT(bhRefl.StoreToReference(stack.Arg1(), 0));
    bhAtten.SetInteger(atten);
    NANOCLR_CHECK_HRESULT(bhAtten.StoreToReference(stack.Arg2(), 0));

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeStartFilter___STATIC__VOID__nanoFrameworkHardwareEsp32TouchIFilterSetting(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32)

    // Static function, argument 0 is the first argument
    CLR_RT_HeapBlock *bhPeriodeSetting;
    uint32_t period;
    int type;
    esp_err_t err;

    bhPeriodeSetting = stack.Arg0().Dereference();
    // sanity check for the type of arguments
    type = (int)bhPeriodeSetting
               [Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_Esp32FilterSetting::
                    FIELD___type]
                   .NumericByRef()
                   .u4;
    if (type != (int)IFilterSetting_FilterType_Esp32)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    period = (uint32_t)bhPeriodeSetting
                 [Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_Esp32FilterSetting::
                      FIELD___period]
                     .NumericByRef()
                     .u4;

    err = touch_pad_filter_start(period);
    if (err != ESP_OK)
    {
        if (err == ESP_ERR_INVALID_ARG)
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
        }
        else
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
        }
    }

    isFilterOn = true;

#elif defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)
    CLR_RT_HeapBlock *bhPeriodeSetting;
    touch_filter_config_t filterConfig;
    int type;
    esp_err_t err;

    bhPeriodeSetting = stack.Arg0().Dereference();
    // sanity check for the type of arguments
    type = (int)bhPeriodeSetting
               [Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_S2S3FilterSetting::
                    FIELD___type]
                   .NumericByRef()
                   .u4;
    if (type != (int)IFilterSetting_FilterType_S2_S3)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    filterConfig.mode =
        (touch_filter_mode_t)bhPeriodeSetting
            [Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_S2S3FilterSetting::
                 FIELD___periodeSettingMode]
                .NumericByRef()
                .s4;
    filterConfig.debounce_cnt =
        (uint32_t)bhPeriodeSetting
            [Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_S2S3FilterSetting::
                 FIELD___filterSettingDebounce]
                .NumericByRef()
                .s4;
    filterConfig.noise_thr =
        (uint32_t)bhPeriodeSetting
            [Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_S2S3FilterSetting::
                 FIELD___filterSettingNoiseThreshold]
                .NumericByRef()
                .s4;
    filterConfig.jitter_step =
        (uint32_t)bhPeriodeSetting
            [Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_S2S3FilterSetting::
                 FIELD___jitterSize]
                .NumericByRef()
                .u1;
    filterConfig.smh_lvl =
        (touch_smooth_mode_t)bhPeriodeSetting
            [Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_S2S3FilterSetting::
                 FIELD___filterSettingSmoothMode]
                .NumericByRef()
                .s4;

    err = touch_pad_filter_set_config(&filterConfig);
    if (err != ESP_OK)
    {
        if (err == ESP_ERR_INVALID_ARG)
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
        }
        else
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
        }
    }

    if (touch_pad_filter_enable() != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

    isFilterOn = true;
#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

    NANOCLR_NOCLEANUP();
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeStopFilter___STATIC__VOID(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

#if defined(CONFIG_IDF_TARGET_ESP32)
    touch_pad_filter_stop();
#else
    touch_pad_filter_disable();
#endif

    isFilterOn = false;
    NANOCLR_NOCLEANUP_NOLABEL();

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
    NANOCLR_NOCLEANUP();
#endif
}

HRESULT Library_nanoFramework_hardware_esp32_native_nanoFramework_Hardware_Esp32_Touch_TouchPad::
    NativeSetMeasurementTime___STATIC__VOID__U2__U2(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

#if defined(CONFIG_IDF_TARGET_ESP32) || defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3)

    // Static function, argument 0 is the first argument
    uint16_t sleep = (uint16_t)stack.Arg0().NumericByRef().u2;
    uint16_t meas = (uint16_t)stack.Arg1().NumericByRef().u2;

    if (touch_pad_set_meas_time(sleep, meas) != ESP_OK)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_OPERATION);
    }

#else
    NANOCLR_SET_AND_LEAVE(CLR_E_NOT_SUPPORTED);
#endif

